pmo-dataset/graphviz/39.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "ParallelGateway_1" -> "List required\nmaterials";
  "ParallelGateway_1" -> "List required tools";
  "ParallelGateway_1" -> "Offer ordering\nchoices";
  "List required\nmaterials" -> "ParallelGateway_2";
  "List required tools" -> "ParallelGateway_2";
  "Offer ordering\nchoices" -> "ParallelGateway_2";
  "Select device model" -> "Select type of\nhardware Issue";
  "Select type of\nhardware Issue" -> "ParallelGateway_1";
  "Display repair\ninstructions" -> "Repair device";
  "Repair device" -> "Is issue fixed?";
  "Send device to an\nexpert" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Hardware issue fixed";
  "ExclusiveGateway_2" -> "Display repair\ninstructions";
  "Write review" -> "ExclusiveGateway_3";
  "ExclusiveGateway_3" -> "Have intention to\nupload a video of\nrepair steps?";
  "Upload video of\nreparation steps" -> "ExclusiveGateway_4";
  "Have intention to\nupload a video of\nrepair steps?" -> "ExclusiveGateway_4" [label="No"];
  "Have intention to\nupload a video of\nrepair steps?" -> "Upload video of\nreparation steps" [label="Yes"];
  "Have intention to\nwrite a review?" -> "Write review" [label="Yes"];
  "Have intention to\nwrite a review?" -> "ExclusiveGateway_3" [label="No"];
  "ExclusiveGateway_4" -> "ExclusiveGateway_1";
  "ExclusiveGateway_5" -> "Log into account";
  "Log into account" -> "Is login Successful?";
  "Is login Successful?" -> "Select device model" [label="Yes"];
  "Is login Successful?" -> "ExclusiveGateway_5" [label="No"];
  "ExclusiveGateway_6" -> "ExclusiveGateway_5";
  "Get second-hand\ntools and materials\nfrom friends" -> "ExclusiveGateway_7";
  "Have intention to\npurchase new items?" -> "purchase online" [label="Yes"];
  "purchase online" -> "ExclusiveGateway_8";
  "Have intention to\nget second-hand\nitems?" -> "ExclusiveGateway_7" [label="No"];
  "Have intention to\npurchase new items?" -> "ExclusiveGateway_8" [label="No"];
  "Create account" -> "ExclusiveGateway_6";
  "Hardware issue\ndetected" -> "Have an account?";
  "Have an account?" -> "Create account" [label="No"];
  "Have an account?" -> "ExclusiveGateway_6" [label="Yes"];
  "Have all required\nitems?" -> "Have intention to\nget second-hand\nitems?" [label="No"];
  "ExclusiveGateway_8" -> "ExclusiveGateway_2";
  "Is issue fixed?" -> "Send device to an\nexpert" [label="No"];
  "Is issue fixed?" -> "Have intention to\nwrite a review?" [label="Yes"];
  "Have intention to\nget second-hand\nitems?" -> "Contact friends" [label="Yes"];
  "Have all required\nitems?" -> "ExclusiveGateway_2" [label="Yes"];
  "Contact friends" -> "Get second-hand\ntools and materials\nfrom friends";
  "ExclusiveGateway_7" -> "Have intention to\npurchase new items?";
  "ParallelGateway_2" -> "Have all required\nitems?";

  "Hardware issue\ndetected" [shape=circle];
  "Hardware issue fixed" [shape=circle, penwidth=4];
  "Is issue fixed?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "Have all required\nitems?" [shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "Have intention to\nwrite a review?" [shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "Have intention to\nupload a video of\nrepair steps?" [shape=diamond];
  "ExclusiveGateway_4" [label="X", shape=diamond];
  "Have an account?" [shape=diamond];
  "ExclusiveGateway_5" [label="X", shape=diamond];
  "Is login Successful?" [shape=diamond];
  "ExclusiveGateway_6" [label="X", shape=diamond];
  "Have intention to\nget second-hand\nitems?" [shape=diamond];
  "ExclusiveGateway_7" [label="X", shape=diamond];
  "Have intention to\npurchase new items?" [shape=diamond];
  "ExclusiveGateway_8" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
}
