pmo-dataset/variations/mermaid_basic/39.mmd
graph LR
	ParallelGateway_1{"+"} --> Task_10["List required materials"]
	ParallelGateway_1 --> Task_11["List required tools"]
	ParallelGateway_1 --> Task_12["Offer ordering choices"]
	Task_10 --> ParallelGateway_2{"+"}
	Task_11 --> ParallelGateway_2
	Task_12 --> ParallelGateway_2
	Task_2["Select device model"] --> Task_1["Select type of hardware Issue"]
	Task_1 --> ParallelGateway_1
	Task_13["Display repair instructions"] --> Task_14["Repair device"]
	Task_14 --> ExclusiveGateway_1{"Is issue fixed?"}
	Task_15["Send device to an expert"] --> ExclusiveGateway_2{"X"}
	ExclusiveGateway_2 --> EndEvent_1(("Hardware issue fixed"))
	ExclusiveGateway_4{"X"} --> Task_13
	Task_3["Write review"] --> ExclusiveGateway_6{"X"}
	ExclusiveGateway_6 --> ExclusiveGateway_7{"Have intention to upload a video of repair steps?"}
	Task_4["Upload video of reparation steps"] --> ExclusiveGateway_8{"X"}
	ExclusiveGateway_7 -->|"No"| ExclusiveGateway_8
	ExclusiveGateway_7 -->|"Yes"| Task_4
	ExclusiveGateway_5{"Have intention to write a review?"} -->|"Yes"| Task_3
	ExclusiveGateway_5 -->|"No"| ExclusiveGateway_6
	ExclusiveGateway_8 --> ExclusiveGateway_2
	ExclusiveGateway_10{"X"} --> Task_7["Log into account"]
	Task_7 --> ExclusiveGateway_11{"Is login Successful?"}
	ExclusiveGateway_11 -->|"Yes"| Task_2
	ExclusiveGateway_11 -->|"No"| ExclusiveGateway_10
	ExclusiveGateway_12{"X"} --> ExclusiveGateway_10
	Task_5["Get second-hand tools and materials from friends"] --> ExclusiveGateway_14{"X"}
	ExclusiveGateway_15{"Have intention to purchase new items?"} -->|"Yes"| Task_6["purchase online"]
	Task_6 --> ExclusiveGateway_16{"X"}
	ExclusiveGateway_13{"Have intention to get second-hand items?"} -->|"No"| ExclusiveGateway_14
	ExclusiveGateway_15 -->|"No"| ExclusiveGateway_16
	Task_8["Create account"] --> ExclusiveGateway_12
	StartEvent_1(("Hardware issue detected")) --> ExclusiveGateway_9{"Have an account?"}
	ExclusiveGateway_9 -->|"No"| Task_8
	ExclusiveGateway_9 -->|"Yes"| ExclusiveGateway_12
	ExclusiveGateway_3{"Have all required items?"} -->|"No"| ExclusiveGateway_13
	ExclusiveGateway_16 --> ExclusiveGateway_4
	ExclusiveGateway_1 -->|"No"| Task_15
	ExclusiveGateway_1 -->|"Yes"| ExclusiveGateway_5
	ExclusiveGateway_13 -->|"Yes"| Task_9["Contact friends"]
	ExclusiveGateway_3 -->|"Yes"| ExclusiveGateway_4
	Task_9 --> Task_5
	ExclusiveGateway_14 --> ExclusiveGateway_15
	ParallelGateway_2 --> ExclusiveGateway_3
